Autodesk.Revit.DB.Lighting.LightShapeStyle
Tags for specific light shape styles
Since:
2013

Autodesk.Revit.DB.Lighting.LightShapeStyle.Circle
Circular light shape.

Autodesk.Revit.DB.Lighting.LightShapeStyle.Rectangle
Rectangular light shape.

Autodesk.Revit.DB.Lighting.LightShapeStyle.Line
Line light shape.

Autodesk.Revit.DB.Lighting.LightShapeStyle.Point
Point light shape.